app/controllers/chefs_controller.rb

	def create

		@chef = Chef.new(chef_params)

		if @chef.save
---
INSERT INTO `chefs` (`chefname`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('tej', 'tejdeep@yahoo.com', '$2a$10$l/I24wnSWI.oWBhDU.PWVuChQcdpvPj.wnYuLx38.KFOQk5iWB77S', '2015-09-05 08:04:25.190893', '2015-09-05 08:04:25.190893')