app/controllers/recipes_controller.rb

	  def index

		@recipe = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

    def show

        @recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 2 LIMIT 1

   def create

   	@recipe = Recipe.new(recipe_params)

   	@recipe.chef = current_user

   	if @recipe.save
---
INSERT INTO `recipes` (`name`, `summary`, `description`, `picture`, `chef_id`, `created_at`, `updated_at`) VALUES ('inthiyaz', 'chicken pakoda kavalo', 'chicken rice iol water stove fire kerosine', '20150206_161612.jpg', 1, '2015-09-04 04:51:14.470596', '2015-09-04 04:51:14.470596')

   def edit

   	@recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1

   def update
   	@recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 5 LIMIT 1

  def like

    @recipe = Recipe.find(params[:id])
---
SELECT  `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 6 LIMIT 1